YellowCollectorClient/src/Catalogs/МаршрутыYellowCollector/МаршрутыYellowCollector.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МаршрутыYellowCollector</name>
  <predefined>
    <items>
      <name>Ping</name>
      <description>Ping</description>
    </items>
    <items>
      <name>V1_ErrorList</name>
      <description>V1. Список ошибок</description>
    </items>
    <items>
      <name>V1_ErrorDetails</name>
      <description>V1 error details</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

YellowCollectorClient/src/CommonModules/ОбновлениеИнфомационнойБазыYellowCollectorClient/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Процедура ПриДобавленииПодсистемы(Описание) Экспорт     
	
    Описание.Имя = "YellowCollectorClient";
    Описание.Версия = "2022.6.1.0";
    Описание.ИдентификаторИнтернетПоддержки = "YellowCollectorClient";
    Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
    
    // Требуется библиотека стандартных подсистем.
    Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры       

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриОпределенииНастроек.
Процедура ПриОпределенииНастроек(Параметры) Экспорт
	
	Параметры.ПараметрыСообщенияОНевыполненныхОтложенныхОбработчиках.КартинкаСообщения = БиблиотекаКартинок.Ошибка32;
	Параметры.Вставить("МногопоточноеОбновление", Истина);
	Параметры.Вставить("КоличествоПотоковОбновленияИнформационнойБазыПоУмолчанию", 4);

КонецПроцедуры


Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = 
	           "ОбновлениеИнфомационнойБазыYellowCollectorClient.ВыполнитьПервоначальноеЗаполнениеМаршрутов";
	           	
КонецПроцедуры      

Процедура ПередОбновлениемИнформационнойБазы() Экспорт
    
КонецПроцедуры 

Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
        Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
    
КонецПроцедуры 
	
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
    
КонецПроцедуры  

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
    
КонецПроцедуры 

Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
    
КонецПроцедуры 

Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
    
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьПервоначальноеЗаполнениеМаршрутов(Параметры = Неопределено) Экспорт
	
	МаршрутОбъектPing = Справочники.МаршрутыYellowCollector.Ping.ПолучитьОбъект();
	МаршрутОбъектPing.АдресРесурса = "api/v1/ping";
	МаршрутОбъектPing.Записать();
	
	МаршрутОбъектV1ErrorList = Справочники.МаршрутыYellowCollector.V1_ErrorList.ПолучитьОбъект();
	МаршрутОбъектV1ErrorList.АдресРесурса = "api/v1/report-errors/list";
	МаршрутОбъектV1ErrorList.Записать();
	
КонецПроцедуры

#КонецОбласти
